src/cf/InformationRegisters/ПереносыСроковВыполненияПроцессовИЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПереносыСроковВыполненияПроцессовИЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БизнесПроцессПереноса</Name>
					<Comment>Заявка, в рамках которой произведен перенос срока</Comment>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.РешениеВопросовВыполненияЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Итерация</Name>
					<Comment>Номер итерации согласования заявки на перенос срока, в рамках которой произведен перенос</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийАвтора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтарыйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаПереносаСрока</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПереносыСроковВыполненияПроцессовИЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись о переносе срока процессов и задач.
//
// Параметры:
//  Предмет - БизнесПроцессСсылка, ЗадачаСсылка.ЗадачаИсполнителя, ДокументСсылка.Задача, ДокументСсылка.ДействиеЗадачи.
//  СтарыйСрок - Дата.
//  НовыйСрок - Дата.
//  КомментарийАвтора - Строка.
//  БизнесПроцессПереноса - БизнесПроцессСсылка.РешениеВопросовВыполненияЗадач.
//
Процедура Добавить(Предмет, СтарыйСрок, НовыйСрок, КомментарийАвтора, БизнесПроцессПереноса) Экспорт
	
	ДатаПереносаСрока = ТекущаяДатаСеанса();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДатаПереносаСрока.Установить(ДатаПереносаСрока);
	НаборЗаписей.Отбор.Предмет.Установить(Предмет);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ДатаПереносаСрока = ДатаПереносаСрока;
	НоваяЗапись.Предмет = Предмет;
	
	НоваяЗапись.КомментарийАвтора = КомментарийАвтора;
	НоваяЗапись.НовыйСрок = НовыйСрок;
	НоваяЗапись.Сотрудник = Сотрудники.ОсновнойСотрудник();
	НоваяЗапись.СтарыйСрок = СтарыйСрок;
	
	Если ЗначениеЗаполнено(БизнесПроцессПереноса) Тогда
		НоваяЗапись.БизнесПроцессПереноса = БизнесПроцессПереноса;
		НоваяЗапись.Итерация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БизнесПроцессПереноса, "Итерация");
	Конецесли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
